# ComponentRepeater_InvalidFamilyOnReload Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ComponentRepeaterFailures..::..ComponentRepeater_InvalidFamilyOnReload Property
BuiltInFailures..::..ComponentRepeaterFailures Class See Also
---
Reloaded family not appropriate for repeater.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ComponentRepeater_InvalidFamilyOnReload { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ComponentRepeater_InvalidFamilyOnReload As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ComponentRepeater_InvalidFamilyOnReload {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ComponentRepeaterFailures Class
Autodesk.Revit.DB Namespace